add learning material
